# shell
brew "ctags"
brew "fzf"
brew "gh"
brew "git"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"

# apps
cask "1password"
cask "1password-cli"
cask "blender"
cask "encryptme"
cask "iterm2"
cask "ngrok"
cask "prusaslicer"
cask "raspberry-pi-imager"
cask "slack"
cask "spotify"
cask "todoist"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "zoom"

# fonts
# tap "homebrew/cask-fonts"
# brew "font-fira-code"
