# Brewfile - Homebrew packages for macOS

# Taps
tap "homebrew/cask-fonts"

# Shell and core utilities
brew "zsh"
brew "starship"
brew "fzf"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "zoxide"

# Development tools
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "lazygit"
brew "mosh"

# Language version managers
brew "fnm"
brew "rbenv"
brew "go"

# Shell scripting tools
brew "shellcheck"
brew "shfmt"

# Additional tools
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "curl"
brew "wget"
brew "gnupg"
brew "httpie"

# Linting
brew "ast-grep"
brew "golangci-lint"

# Build tools
brew "make"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fira-code-nerd-font"

# Apps
cask "1password-cli"
cask "ghostty"
